tutorials/fluids/windAroundBuildings/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }
    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }
    Up
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type l2;
            snes_max_it "1";
            snes_rtol "1e-3";
            snes_stol "1e-3";
            snes_monitor;
            snes_converged_reason;
            snes_max_linear_solve_fail "1000";

            // Matrix-free operator
            // enabled: Picard iteration
            // disabled: Newton iteration
            snes_mf_operator;

            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_rtol "1e-4";
            ksp_converged_reason;
            ksp_max_it "80";

            pc_type fieldsplit;
            pc_fieldsplit_type schur;
            pc_fieldsplit_schur_fact_type lower;
            pc_fieldsplit_schur_precondition selfp;
            pc_fieldsplit_block_size "4";
            pc_fieldsplit_0_fields "0,1,2";
            pc_fieldsplit_1_fields "3";

            // Velocity sub-block: bjacobi + ILU(0)
            fieldsplit_0_ksp_type preonly;
            fieldsplit_0_pc_type bjacobi;
            fieldsplit_0_sub_pc_type ilu;
            fieldsplit_0_sub_pc_factor_levels "0";

            // Pressure Schur complement: HYPRE BoomerAMG
            fieldsplit_1_ksp_type preonly;
            fieldsplit_1_pc_type hypre;
            fieldsplit_1_pc_hypre_type boomeramg;
            fieldsplit_1_pc_hypre_boomeramg_max_iter "1";
            fieldsplit_1_pc_hypre_boomeramg_strong_threshold "0.6";
            fieldsplit_1_pc_hypre_boomeramg_grid_sweeps_up "1";
            fieldsplit_1_pc_hypre_boomeramg_grid_sweeps_down "1";
            fieldsplit_1_pc_hypre_boomeramg_agg_nl "1";
            fieldsplit_1_pc_hypre_boomeramg_agg_num_paths "1";
            fieldsplit_1_pc_hypre_boomeramg_max_levels "25";
            fieldsplit_1_pc_hypre_boomeramg_coarsen_type HMIS;
            fieldsplit_1_pc_hypre_boomeramg_interp_type ext+i;
            fieldsplit_1_pc_hypre_boomeramg_P_max "1";
            fieldsplit_1_pc_hypre_boomeramg_truncfactor "0.3";
        }
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        // p                     0.3;
    }
    equations
    {
        // U                     0.7;
        "(k|omega|epsilon).*" 0.7;
    }
}


// ************************************************************************* //
